In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'E:\Goeduhub_ML_Program_May_20\data\hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [5]:
df['experience'].fillna(0,inplace=True)
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean(),inplace=True)

In [6]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0               8.000000                           9      50000
1          0               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [10]:
def string_to_num(word):
    dict={'zero':0,'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11,'twelve':12,0:0}
    return dict[word]

In [11]:
df['experience']=df['experience'].apply(lambda x : string_to_num(x))
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [12]:
x=df.iloc[:,:3]
y=df.iloc[:,-1]

In [13]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.26,random_state=5)

In [15]:
from sklearn.linear_model import LinearRegression
mymodel=LinearRegression()

mymodel.fit(xtrain,ytrain)

LinearRegression()

In [17]:
ypred=mymodel.predict(xtest)

In [18]:
ypred

array([76049.39565822, 55623.3425061 , 64336.33476229])

In [16]:
y=mymodel.predict([[5,8,7]])
y

array([59796.86378754])

In [19]:
import pickle

In [20]:
pickle.dump(mymodel,open('model.pkl','wb'))